
// --------------------------------------------------------------------------------
// Copyright (c) 2024 Igor Ryabov (https://github.com/IgorRyaboff/Instrumentiki)
// License: https://github.com/IgorRyaboff/Instrumentiki/blob/main/LICENSE
// --------------------------------------------------------------------------------

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВТерминах = "СУБД";
	ЗаполнитьСтруктуруХранения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВТерминахПриИзменении(Элемент)
	Состояние("Подождите...");
	ЗаполнитьСтруктуруХранения();
	Состояние();
КонецПроцедуры

&НаКлиенте
Процедура ПодзаголовокФормыПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ПодзаголовокФормы) Тогда
		Заголовок = СтрШаблон(НСтр("ru='%1: Структура хранения базы данных'"), ПодзаголовокФормы);
	Иначе
		Заголовок = НСтр("ru='Структура хранения базы данных'");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтруктуруХранения()
	Структура = ПолучитьСтруктуруХраненияБазыДанных(, ВТерминах = "СУБД");
	ЗначениеВРеквизитФормы(Структура, "СтруктураХранения");
КонецПроцедуры

#КонецОбласти
