
// --------------------------------------------------------------------------------
// Copyright (c) 2024 Igor Ryabov (https://github.com/IgorRyaboff/Instrumentiki)
// License: https://github.com/IgorRyaboff/Instrumentiki/blob/main/LICENSE
// --------------------------------------------------------------------------------

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.БезопасныйРежим Тогда
		Сообщить(НСтр("ru='Этот инструмент недоступен при работе в безопасном режиме'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Таймаут = 5;
	УбитьПроцессПослеТаймаута = Истина;
	КодЗавершения = NULL;
	
	Если НаСервереWindows() Тогда
		Элементы.ТипСкрипта.СписокВыбора.Добавить("bat", "BAT");
		Элементы.ТипСкрипта.СписокВыбора.Добавить("ps1", "PowerShell");
	Иначе
		Элементы.ТипСкрипта.СписокВыбора.Добавить("sh", "Bash");
	КонецЕсли;
	ТипСкрипта = Элементы.ТипСкрипта.СписокВыбора[0].Значение;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВыполнитьСкрипт(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=") = 1 И Не ПредупреждениеДляФайловойБазыУжеВыдано Тогда
		Ждать ПредупреждениеАсинх("Обработка запущена в файловой базе, команда будет выполнена в текущем сеансе пользователя Windows. Лучше запустить обычную командную строку");
		ПредупреждениеДляФайловойБазыУжеВыдано = Истина;
	КонецЕсли;
	
	ПараметрыЗапускаСкрипта = НовыеПараметрыЗапускаСкрипта();
	ПараметрыЗапускаСкрипта.Текст = ТекстСкрипта;
	ПараметрыЗапускаСкрипта.Тип = ТипСкрипта;
	ПараметрыЗапускаСкрипта.Таймаут = Таймаут;
	ПараметрыЗапускаСкрипта.ПрерватьПоДостиженииТаймаута = УбитьПроцессПослеТаймаута;
	
	Состояние("Выполнение команды...");
	Вывод = ВыполнитьСкриптНаСервере(ПараметрыЗапускаСкрипта);
	РезультатВыполнения.УстановитьТекст(Вывод);
	Состояние();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция НовыеПараметрыЗапускаСкрипта() Экспорт
	ПараметрыЗапуска = Новый Структура;
	
	ПараметрыЗапуска.Вставить("Текст", "");
	ПараметрыЗапуска.Вставить("Тип", "");
	ПараметрыЗапуска.Вставить("Таймаут", "");
	ПараметрыЗапуска.Вставить("ПрерватьПоДостиженииТаймаута", "");
	
	Возврат ПараметрыЗапуска;
КонецФункции

&НаСервереБезКонтекста
Функция НаСервереWindows()
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
	Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64);
КонецФункции

// Непосредственно выполняет команду, используя компоненту WScript.Shell
//
// Параметры:
//  ТекстКоманды - Строка -
//
// Возвращаемое значение:
//  Структура:
//  * Статус - Строка -
//  * КодЗавершения - Число - Код, с которым завершился процесс
//  * Вывод - ДвоичныеДанные, Строка - Вывод процесса (stdout или stderr)
&НаСервереБезКонтекста
Функция ВыполнитьСкриптНаСервере(Знач ПараметрыЗапускаСкрипта)
	Если НаСервереWindows() Тогда
		Возврат ВыполнитьСкриптНаСервереWindows(ПараметрыЗапускаСкрипта);
	Иначе
		Возврат ВыполнитьСкриптНаСервереLinux(ПараметрыЗапускаСкрипта);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьСкриптНаСервереWindows(ПараметрыЗапускаСкрипта)
	// TODO: Реализовать использование УбитьПроцессПослеТаймаута
	ИмяФайлаСкрипта = ПолучитьИмяВременногоФайла(ПараметрыЗапускаСкрипта.Тип);
	ИмяФайлаОбертки = ПолучитьИмяВременногоФайла("ps1");
	ИмяФайлаЛог = ПолучитьИмяВременногоФайла("log");
	
	Таймаут = ПараметрыЗапускаСкрипта.Таймаут;
	
	ТекстОбертки = СтрШаблон("$job = Start-Job -ScriptBlock {
                              |    $pinfo = New-Object System.Diagnostics.ProcessStartInfo
                              |    $pinfo.FileName = ""%1""
                              |
                              |    $pinfo.RedirectStandardError = $true
                              |    $pinfo.RedirectStandardOutput = $true
                              |    
                              |    $pinfo.UseShellExecute = $false
                              |    $p = New-Object System.Diagnostics.Process
                              |    $p.StartInfo = $pinfo
                              |    $p.Start() | Out-Null
                              |    $p.WaitForExit()
                              |    $stdout = $p.StandardOutput.ReadToEnd()
                              |    $stderr = $p.StandardError.ReadToEnd()
                              |    Start-Transcript -Path ""%2""
                              |    Write-Host $stdout
                              |    Write-Host $stderr
                              |    Write-Host ""PROCESS EXIT CODE: "" $p.ExitCode
                              |    Stop-Transcript
                              |}
                              |
                              |Wait-Job -Timeout %3 -Job $job", ИмяФайлаСкрипта, ИмяФайлаЛог, Таймаут);
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаОбертки, КодировкаТекста.ANSI);
	ЗаписьТекста.Записать(ТекстОбертки);
	ЗаписьТекста.Закрыть();
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаСкрипта, КодировкаТекста.ANSI);
	ЗаписьТекста.ЗаписатьСтроку("chcp 861");
	ЗаписьТекста.Записать(ПараметрыЗапускаСкрипта.Текст);
	ЗаписьТекста.Закрыть();
	
	КомандаЗапуска = СтрШаблон("powershell -File ""%1""", ИмяФайлаОбертки);
	ВызватьИсключение "FIXME: Таймаут не отрабатывает";
	ЗапуститьПриложение(КомандаЗапуска,, Истина);
	
	УказательФайлаЛог = Новый Файл(ИмяФайлаЛог);
	Если Не УказательФайлаЛог.Существует() Тогда
		Возврат НСтр("ru='<< Выполнение скрипта было прервано по таймауту >>'");
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаЛог);
	Лог = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ПопытатьсяУдалитьФайл(ИмяФайлаСкрипта);
	ПопытатьсяУдалитьФайл(ИмяФайлаОбертки);
	ПопытатьсяУдалитьФайл(ИмяФайлаЛог);
	
	Возврат Лог;
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьСкриптНаСервереLinux(ПараметрыЗапускаСкрипта)
	// TODO: Реализовать использование УбитьПроцессПослеТаймаута
КонецФункции

&НаСервереБезКонтекста
Процедура ПопытатьсяУдалитьФайл(Путь)
	Попытка
		УдалитьФайлы(Путь);
	Исключение
		Возврат; // Ничего не делаем
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
