

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВерсияПлатформы < 3.25 Тогда
		Элементы.РежимСлияние.Видимость = Ложь;
		Элементы.РежимУдаление.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ВерсияПлатформы < 3.26 Тогда
		Элементы.РежимОбновление.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Если Не ЗначениеЗаполнено(Режим) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Режим не выбран'"));
		Возврат;
	КонецЕсли;
	
	Значения = Новый Соответствие;
	
	Значения["Замещение"] = Истина;
	Значения["Добавление"] = Ложь;
	Если Объект.ВерсияПлатформы >= 3.25 Тогда
		Значения["Слияние"] = ПредопределенноеЗначение("РежимЗамещения.Слияние");
		Значения["Удаление"] = ПредопределенноеЗначение("РежимЗамещения.Удаление");
	КонецЕсли;
	Если Объект.ВерсияПлатформы >= 3.26 Тогда
		Значения["Обновление"] = ПредопределенноеЗначение("РежимЗамещения.Обновление");
	КонецЕсли;
	
	Закрыть(Значения[Режим]);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти
