
// --------------------------------------------------------------------------------
// Copyright (c) 2025 Igor Ryabov (https://github.com/IgorRyaboff/Instrumentiki)
// License: https://github.com/IgorRyaboff/Instrumentiki/blob/main/LICENSE
// --------------------------------------------------------------------------------

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВТерминах = "СУБД";
	ЗаполнитьСтруктуруХранения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВТерминахПриИзменении(Элемент)
	Состояние("Подождите...");
	ЗаполнитьСтруктуруХранения();
	Состояние();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтруктуруХранения()
	Структура = ПолучитьСтруктуруХраненияБазыДанных(, ВТерминах = "СУБД");
	ЗначениеВРеквизитФормы(Структура, "СтруктураХранения");
КонецПроцедуры

#КонецОбласти
