
// --------------------------------------------------------------------------------
// Copyright (c) 2024 Igor Ryabov (https://github.com/IgorRyaboff/Instrumentiki)
// License: https://github.com/IgorRyaboff/Instrumentiki/blob/main/LICENSE
// --------------------------------------------------------------------------------

// Форма предназначена для выбора объекта ссылочного типа из Редактора объектов
//
// Параметры формы:
//  ПолноеИмяМетаданных - Строка - Например, "Справочник.Банки"
//
// Параметр закрытия:
//  ЛюбаяСсылка - ссылка на выбранный объект
//  Неопределено - при закрытии формы пользователем

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МетаданныеСсылки = Параметры.ОпорнаяСсылка.Метаданные();
	Если Не ПравоДоступа("Просмотр", МетаданныеСсылки) Тогда
		Сообщить(НСтр("ru='Отсутствует право просмотра'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПолноеИмяМетаданных = МетаданныеСсылки.ПолноеИмя();
	Список.ТекстЗапроса = СтрШаблон("ВЫБРАТЬ * ИЗ %1 КАК Таблица", ПолноеИмяМетаданных);
	Список.ОсновнаяТаблица = ПолноеИмяМетаданных;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСсылка = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ТекущаяСсылка) Тогда
		Закрыть(ТекущаяСсылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИЗакрыть(Команда)
	Закрыть(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
